book/assets/assessments/forLoopPythonAssessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-13 Mon 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>For Loop with Python</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">For Loop with Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb0933a7">1. Task</a></li>
<li><a href="#org4c29a6f">2. What it should look like</a></li>
<li><a href="#orgc7bd1b8">3. Detailed Instructions</a></li>
<li><a href="#orgf3f4f8b">4. Comments</a>
<ul>
<li><a href="#orgec3fdce">4.1. Hints</a></li>
<li><a href="#org81ea9e3">4.2. How I Will Grade</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb0933a7" class="outline-2">
<h2 id="orgb0933a7"><span class="section-number-2">1.</span> Task</h2>
<div class="outline-text-2" id="text-1">
<p>
Write a function that will print a list of characters unsorted, sorted, and combined. To complete this task you will need to be familiar with how to write a <b>for loop</b>, use python's <b>indexing</b>, and also how to use the <a href="https://realpython.com/python-formatted-output/">print format command</a> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> 
</p>
</div>
</div>

<div id="outline-container-org4c29a6f" class="outline-2">
<h2 id="org4c29a6f"><span class="section-number-2">2.</span> What it should look like</h2>
<div class="outline-text-2" id="text-2">
<p>
I run your function with "trib". It prints t, r, i, b, then prints b, i, r, t, and then prints something like "The first letter of list one is 't', but it is 'b' in the sorted list&#x2026; and so on through all the letters.
</p>
</div>
</div>

<div id="outline-container-orgc7bd1b8" class="outline-2">
<h2 id="orgc7bd1b8"><span class="section-number-2">3.</span> Detailed Instructions</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Create a list of at least 8 individual characters.</li>
<li>Make sure they are <b><b>not</b></b> in alphabetical order</li>
<li>Print the letters one at a time.</li>
<li>Print the letters sorted alphabetically one at a time, but <i>do not</i> overwrite your original list.</li>
<li>Print the letters from both lists with a format command that says which position the letter is in.</li>
</ol>
</div>
</div>

<div id="outline-container-orgf3f4f8b" class="outline-2">
<h2 id="orgf3f4f8b"><span class="section-number-2">4.</span> Comments</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgec3fdce" class="outline-3">
<h3 id="orgec3fdce"><span class="section-number-3">4.1.</span> Hints</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Remember not to re-invent the wheel. For example, does python have a function for sorting lists? Can you turn a "string" into a python list that would allow you to use indices? Lastly, note that a for loop can use more than one variable at a time. For my version I have a line that reads, 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">for</span> i,l <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">enumerate</span>(<span style="color: #483d8b;">zip</span>(myList,<span style="color: #483d8b;">sorted</span>(myList))):
</pre>
</div>
</div>
</div>

<div id="outline-container-org81ea9e3" class="outline-3">
<h3 id="org81ea9e3"><span class="section-number-3">4.2.</span> How I Will Grade</h3>
<div class="outline-text-3" id="text-4-2">
<p>
I will run your program from the command line e.g. <code>python firstLast2LstsSorted.py</code>. It will either spit out the correct lists or it won't. If it does you get full credit, and if not I will give partial credit and you can try to fix it for more points. 
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Not shown in lecture, but explained in many <a href="https://realpython.com/python-formatted-output/">places</a>. Look for the <code>string.format()</code> method.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-13 Mon 11:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>